src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КассоваяСмена/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает последнюю кассовую смену.
//
Функция ПолучитьПоследнююКассовуюСмену(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.НачалоКассовойСмены УБЫВ");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Функция - Получить текущую открытую кассовую смену
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекущуюОткрытуюКассовуюСмену(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Касса = &Касса
	|	И КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = Неопределено;
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.КассоваяСмена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.Касса КАК Касса,
	|	ЕСТЬNULL(ДенежныеСредства.СуммаОстаток, 0) КАК НаличностьВКассе,
	|	КассоваяСмена.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КассоваяСмена.СтатусыКассовойСмены КАК СтатусыКассовойСмены,
	|	КассоваяСмена.НачалоКассовойСмены КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены  КАК ОкончаниеКассовойСмены,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(, БанковскийСчетКасса = &Касса) КАК ДенежныеСредства
	|		ПО КассоваяСмена.Касса = ДенежныеСредства.БанковскийСчетКасса
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	ОписаниеКассовойСмены = Неопределено;
	Если Выборка.Следующий() Тогда	
		ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	КонецЕсли;	
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции // ПолучитьСостояниеКассовойСмены()

// Функция проверяет состояние кассовой смены на дату. Если смена не открыта - возвращаеся описание ошибки.
//
Функция СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки = "") Экспорт
	
	СменаОткрыта = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассоваяСмена.НачалоКассовойСмены КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Ссылка = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru='Кассовая смена не открыта';en='Cash change not isopen'");
		СменаОткрыта = Ложь;
		
	КонецЕсли;
	
	Возврат СменаОткрыта;
	
КонецФункции // СменаОткрыта()

// Функция - Открыть кассовую смену
//
// Параметры:
//  Касса			 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОткрытьКассовуюСмену(Касса, ОписаниеОшибки = "") Экспорт
	
	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
	Результат                 = Ложь;
	ТекущаяКассоваяСмена      = ПолучитьСостояниеКассовойСмены(Касса);
	
	Если ТекущаяКассоваяСмена = Неопределено 
		ИЛИ ТекущаяКассоваяСмена.СтатусыКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		
		НоваяКассоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяКассоваяСмена.Заполнить(Новый Структура("Касса", Касса));
		
		НоваяКассоваяСмена.Дата                   = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.СтруктурнаяЕдиница	  = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		НоваяКассоваяСмена.СтатусыКассовойСмены   = Перечисления.СтатусыКассовойСмены.Открыта;
		НоваяКассоваяСмена.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.ОкончаниеКассовойСмены = Неопределено;
		
		Если НоваяКассоваяСмена.ПроверитьЗаполнение() Тогда
			НоваяКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
			Результат	   = Истина;
		Иначе
			Результат      = Ложь;
			ОписаниеОшибки = НСтр("ru='Произошла ошибка при открытии новой смены: ';en='There was a mistake with opening new shifts:'") +  ОписаниеОшибки();
		КонецЕсли;
		
	ИначеЕсли ТекущаяКассоваяСмена <> Неопределено 
		И ТекущаяКассоваяСмена.СтатусыКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда 
		
		ВремяСМоментаОткрытия = ТекущаяДата() - ТекущаяКассоваяСмена.НачалоКассовойСмены;
		Если ВремяСМоментаОткрытия >= 86400 Тогда
			Результат      = Ложь;
			ОписаниеОшибки = НСтр("ru='Запрещено открытие новой смены! Предварительно необходимо выполнить закрытие текущей кассовой смены.';
								  |en='Prohibited opening new shifts! Pre is necessary to run the current cashier shifts.'");
		Иначе
			Результат      = Ложь;
			ОписаниеОшибки = НСтр("ru='Запрещено открытие новой смены! С момента открытия текущей кассовой смены не истекло 24 часа.';
								  |en='Prohibited opening new shifts! Since the discoveries of the current cash shifts not expired 24 hours.'");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;	 
	
КонецФункции

// Функция - Закрыть кассовую смену
//
// Параметры:
//  Касса			 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗакрытьКассовуюСмену(Касса, ОписаниеОшибки = "", ВремяЗакрытияСмены = Неопределено) Экспорт
	
	Если ВремяЗакрытияСмены = Неопределено Тогда
		ДатаЗакрытияКассовойСмены = ТекущаяДата(); 
	Иначе
		ДатаЗакрытияКассовойСмены = НачалоДня(ТекущаяДата()) + Час(ВремяЗакрытияСмены) * 60 * 60 + Минута(ВремяЗакрытияСмены) * 60;  
	КонецЕсли;
	Результат                 = Ложь;
	ТекущаяКассоваяСмена      = ПолучитьСостояниеКассовойСмены(Касса);
	
	Если ТекущаяКассоваяСмена <> Неопределено И ТекущаяКассоваяСмена.СтатусыКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		КассоваяСменаОбъект                        = ТекущаяКассоваяСмена.КассоваяСмена.ПолучитьОбъект();
		КассоваяСменаОбъект.СтатусыКассовойСмены   = Перечисления.СтатусыКассовойСмены.Закрыта;
		КассоваяСменаОбъект.ОкончаниеКассовойСмены = ДатаЗакрытияКассовойСмены;
		Попытка
			КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Результат = Истина;
		Исключение
			
			Результат = Ложь;
			
			ОписаниеОшибки = НСтр("ru='При закрытии кассовой смены произошла ошибка.
			                      |Дополнительное описание:
								  |%ДополнительноеОписание%';
								  |en='With closing cash register.
								  |Additional description:
								  |%ДополнительноеОписание%'");
			
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
			
		КонецПопытки;		
	Иначе		
		ОписаниеОшибки = НСтр("ru='Попытка закрыть, не открытую смену!!';en='Attempt close not open shift!!'");		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КМ6") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"КМ6",
		"Отчет за смену",
		СформироватьПечатнуюФормуКМ6(МассивОбъектов, ОбъектыПечати)
		);
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция формирует табличный документ обложки кассовой книги
//
Функция СформироватьПечатнуюФормуКМ6(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КМ6";
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.КассоваяСмена.ПФ_MXL_КМ6");
	
	//Для каждого КассоваяСмена Из МассивОбъектов Цикл
	//	
	//	Если ТипЗнч(КассоваяСмена) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
	//		КассоваяСмена = КассоваяСмена.КассоваяСмена;
	//	КонецЕсли;
	//
	//	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ,
	//	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СтруктурнаяЕдиница,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаПриход > 0
	//	|				ТОГДА ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаПриход
	//	|		КОНЕЦ) КАК Итого,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ДенежныеСредстваВКассахККМОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВыемкаИзКассыККМ
	//	|				ТОГДА 0
	//	|			ИНАЧЕ ЕСТЬNULL(ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРасход, 0)
	//	|		КОНЕЦ) КАК ИтогоВозвратов
	//	|ПОМЕСТИТЬ ПриходыВозвратКассаККМ
	//	|ИЗ
	//	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
	//	|			&НачалоСмены,
	//	|			&КонецСмены,
	//	|			Авто,
	//	|			КассаККМ = &КассаККМ
	//	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ДенежныеСредстваВКассахККМОстаткиИОбороты
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ,
	//	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СтруктурнаяЕдиница
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ВложенныйЗапрос.КассаККМ КАК КассаККМ,
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0)) КАК СуммаНачальныйОстаток
	//	|ПОМЕСТИТЬ  ОстаткиНачалоИКонецКассаККМ
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		СУММА(ЕСТЬNULL(ДенежныеСредстваВКассахККМ.Сумма, 0)) КАК Сумма,
	//	|		ДенежныеСредстваВКассахККМ.КассаККМ КАК КассаККМ,
	//	|		ДенежныеСредстваВКассахККМ.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	//	|	ИЗ
	//	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредстваВКассахККМ
	//	|	ГДЕ
	//	|		ДенежныеСредстваВКассахККМ.КассаККМ = &КассаККМ
	//	|		И ДенежныеСредстваВКассахККМ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//	|		И ДенежныеСредстваВКассахККМ.Период < &НачалоСмены
	//	|		И ДенежныеСредстваВКассахККМ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		ДенежныеСредстваВКассахККМ.КассаККМ,
	//	|		ДенежныеСредстваВКассахККМ.СтруктурнаяЕдиница
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		СУММА(ЕСТЬNULL(РасчетыПоЭквайрингу.Сумма, 0)),
	//	|		РасчетыПоЭквайрингу.ЭквайринговыйТерминал.Касса.Ссылка,
	//	|		РасчетыПоЭквайрингу.СтруктурнаяЕдиница
	//	|	ИЗ
	//	|		РегистрНакопления.РасчетыПоЭквайрингу КАК РасчетыПоЭквайрингу
	//	|	ГДЕ
	//	|		РасчетыПоЭквайрингу.Период < &НачалоСмены
	//	|		И РасчетыПоЭквайрингу.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//	|		И РасчетыПоЭквайрингу.ЭквайринговыйТерминал.Касса.Ссылка = &КассаККМ
	//	|		И РасчетыПоЭквайрингу.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//	|		И РасчетыПоЭквайрингу.ТипДенежныхСредств = ЗНАЧЕНИЕ(перечисление.типыДенежныхСредств.Безналичные)
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		РасчетыПоЭквайрингу.СтруктурнаяЕдиница,
	//	|		РасчетыПоЭквайрингу.ЭквайринговыйТерминал.Касса.Ссылка) КАК ВложенныйЗапрос
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//	|	ВложенныйЗапрос.КассаККМ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ВложенныйЗапрос.КассаККМ,
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.ИтогоВозвратКарты, 0)) КАК ИтогоВозвратКарты,
	//	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.ИтогоКарты, 0)) КАК ИтогоКарты
	//	|ПОМЕСТИТЬ ПриходВозвратыКарты
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		ОперацияПоПлатежнойКарте.КассаККМ КАК КассаККМ,
	//	|		ОперацияПоПлатежнойКарте.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|		ЕСТЬNULL(ВЫБОР
	//	|				КОГДА ОперацияПоПлатежнойКарте.ВидОперации = ЗНАЧЕНИЕ(перечисление.видыопераций.ВозвратОплатыКлиенту)
	//	|					ТОГДА ОперацияПоПлатежнойКарте.СуммаДокумента
	//	|				ИНАЧЕ 0
	//	|			КОНЕЦ, 0) КАК ИтогоВозвратКарты,
	//	|		ЕСТЬNULL(ВЫБОР
	//	|				КОГДА ОперацияПоПлатежнойКарте.ВидОперации <> ЗНАЧЕНИЕ(перечисление.видыопераций.ВозвратОплатыКлиенту)
	//	|					ТОГДА ОперацияПоПлатежнойКарте.СуммаДокумента
	//	|				ИНАЧЕ 0
	//	|			КОНЕЦ, 0) КАК ИтогоКарты
	//	|	ИЗ
	//	|		Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте
	//	|	ГДЕ
	//	|		ОперацияПоПлатежнойКарте.Проведен
	//	|		И ОперацияПоПлатежнойКарте.Дата МЕЖДУ &НачалоСмены И &КонецСмены
	//	|		И ОперацияПоПлатежнойКарте.КассаККМ = &КассаККМ
	//	|		И ОперацияПоПлатежнойКарте.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//	|		И ОперацияПоПлатежнойКарте.НомерЧекаККМ <> 0
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.КассаККМ,
	//	|		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.СтруктурнаяЕдиница,
	//	|		ЕСТЬNULL(ВЫБОР
	//	|				КОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма < 0
	//	|					ТОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма * -1
	//	|				ИНАЧЕ 0
	//	|			КОНЕЦ, 0),
	//	|		ЕСТЬNULL(ВЫБОР
	//	|				КОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма > 0
	//	|					ТОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма
	//	|				ИНАЧЕ 0
	//	|			КОНЕЦ, 0)
	//	|	ИЗ
	//	|		Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
	//	|	ГДЕ
	//	|		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.Проведен
	//	|		И ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена) КАК ВложенныйЗапрос
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВложенныйЗапрос.КассаККМ,
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ПриходыВозвратКассаККМ.КассаККМ,
	//	|	ПриходыВозвратКассаККМ.СтруктурнаяЕдиница,
	//	|	СУММА(ЕСТЬNULL(ПриходыВозвратКассаККМ.Итого, 0)) КАК Итого,
	//	|	СУММА(ЕСТЬNULL(ПриходыВозвратКассаККМ.ИтогоВозвратов, 0)) КАК ИтогоВозврат,
	//	|	СУММА(ЕСТЬNULL(ОстаткиНачалоИКонецКассаККМ.СуммаНачальныйОстаток, 0)) КАК НачальныйОстаток,
	//	|	ЕСТЬNULL(ПриходВозвратыКарты.ИтогоВозвратКарты, 0) КАК ИтогоВозвратКарты,
	//	|	ЕСТЬNULL(ПриходВозвратыКарты.ИтогоКарты, 0) КАК ИтогоКарты
	//	|ИЗ
	//	|	ПриходыВозвратКассаККМ КАК ПриходыВозвратКассаККМ
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНачалоИКонецКассаККМ КАК ОстаткиНачалоИКонецКассаККМ
	//	|		ПО ПриходыВозвратКассаККМ.КассаККМ = ОстаткиНачалоИКонецКассаККМ.КассаККМ
	//	|			И ПриходыВозвратКассаККМ.СтруктурнаяЕдиница = ОстаткиНачалоИКонецКассаККМ.СтруктурнаяЕдиница
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриходВозвратыКарты КАК ПриходВозвратыКарты
	//	|		ПО ПриходыВозвратКассаККМ.КассаККМ = ПриходВозвратыКарты.КассаККМ
	//	|			И ПриходыВозвратКассаККМ.СтруктурнаяЕдиница = ПриходВозвратыКарты.СтруктурнаяЕдиница
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ПриходыВозвратКассаККМ.КассаККМ,
	//	|	ПриходыВозвратКассаККМ.СтруктурнаяЕдиница,
	//	|	ЕСТЬNULL(ПриходВозвратыКарты.ИтогоВозвратКарты, 0),
	//	|	ЕСТЬNULL(ПриходВозвратыКарты.ИтогоКарты, 0)";
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = ТекстЗапроса;
	//	
	//	Запрос.УстановитьПараметр("КассоваяСмена"          , КассоваяСмена.Ссылка);
	//	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"     , КассоваяСмена.СтруктурнаяЕдиница);
	//	Запрос.УстановитьПараметр("КассаККМ"               , КассоваяСмена.КассаККМ); 		//
	//	Запрос.УстановитьПараметр("НачалоСмены"            , КассоваяСмена.НачалоКассовойСмены);
	//	Запрос.УстановитьПараметр("КонецСмены"             , КассоваяСмена.ОкончаниеКассовойСмены + 120);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	СведенияОПокупателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(КассоваяСмена.СтруктурнаяЕдиница.Организация, КассоваяСмена.Дата, ,);
	//	СведенияОВнешнемОборудовании = Справочники.ВнешнееОборудование.ПолучитьСведенияОВнешнемОборудовании(КассоваяСмена.КассаККМ.ВнешнееОборудование);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.СтруктурнаяЕдиницаПредставление = "";
	//	ОбластьМакета.Параметры.ОрганизацияПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ОфициальноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	//	ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОПокупателе.КодПоОКПО;
	//	ОбластьМакета.Параметры.ОрганизацияИНН           = СведенияОПокупателе.ИНН;
	//	ОбластьМакета.Параметры.ПрограммаУчета           = "1С:Предприятие 8";
	//	ОбластьМакета.Параметры.НомерДокумента           = КассоваяСмена.Номер;
	//	ОбластьМакета.Параметры.КассоваяСмена            = КассоваяСмена.Номер;
	//	ОбластьМакета.Параметры.ДатаДокумента            = Формат(КассоваяСмена.Дата, "ДФ=dd.MM.yyyy");    		
	//	ОбластьМакета.Параметры.НачалоСмены              = Формат(КассоваяСмена.НачалоКассовойСмены, "ДФ=ЧЧ:мм");
	//	ОбластьМакета.Параметры.ОкончаниеСмены           = Формат(КассоваяСмена.ОкончаниеКассовойСмены, "ДФ=ЧЧ:мм");
	//	
	//	Если СведенияОВнешнемОборудовании <> Неопределено Тогда
	//		ЗаполнитьСведенияОВнешнемОборудовании(СведенияОВнешнемОборудовании, ОбластьМакета);
	//	КонецЕсли;
	//	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//	ОбластьМакета.Параметры.Суммарубкоп= "Сумма"+ ОбщегоНазначения.ПолучитьСимвольныйКодЦелойчастиВалюты()+","+ ОбщегоНазначения.ПолучитьСимвольныйКодДробнойЧастиВалюты();
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//	
	//	СуммаПрописью = 0;
	//	Итого         = 0;
	//	ИтогоВозврат  = 0;
	//	Пока Выборка.Следующий() Цикл   			
	//		ОбластьМакета.Параметры.Итого            = Выборка.Итого + Выборка.ИтогоКарты;
	//		ОбластьМакета.Параметры.ИтогоВозврат     = Выборка.ИтогоВозврат + Выборка.ИтогоВозвратКарты;
	//		ОбластьМакета.Параметры.Сотрудник        = КассоваяСмена.АвторДокумента;
	//		ОбластьМакета.Параметры.НачальныйОстаток = Выборка.НачальныйОстаток;
	//		ОбластьМакета.Параметры.КонечныйОстаток  = Выборка.НачальныйОстаток +  Выборка.Итого + Выборка.ИтогоКарты;
	//		ТабДокумент.Вывести(ОбластьМакета);
	//		
	//		СуммаПрописью = СуммаПрописью + ((Выборка.Итого + Выборка.ИтогоКарты) - (Выборка.ИтогоВозврат + Выборка.ИтогоВозвратКарты));
	//		Итого         = Итого + Выборка.Итого + Выборка.ИтогоКарты;
	//		ИтогоВозврат  = ИтогоВозврат + Выборка.ИтогоВозврат + Выборка.ИтогоВозвратКарты;
	//	КонецЦикла;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	//	ОбластьМакета.Параметры.Итого                = Итого;
	//	ОбластьМакета.Параметры.ИтогоВозврат         = ИтогоВозврат;
	//	ОбластьМакета.Параметры.СуммаВыручкиПрописью = Формат(СуммаПрописью, "ЧЦ=15; ЧДЦ=2") + " (" + ФормированиеПечатныхФорм.СформироватьСуммуПрописью(
	//	СуммаПрописью, КассоваяСмена.КассаККМ.ВалютаДенежныхСредств) + ")";   		
	//	ТабДокумент.Вывести(ОбластьМакета);	
	//	
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");  		
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	//	Кассир = ОбщегоНазначения.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(КассоваяСмена.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Кассир, КассоваяСмена.Дата);
	//	Если Кассир.Количество() > 0 Тогда 
	//		ОбластьМакета.Параметры.ФИОКассир = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кассир[0].Сотрудник));
	//	КонецЕсли;	
	//	
	//	Руководитель = ОбщегоНазначения.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(КассоваяСмена.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Руководитель, КассоваяСмена.Дата);
	//	Если Руководитель.Количество() > 0 Тогда 
	//		ОбластьМакета.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Руководитель[0].Сотрудник));
	//	КонецЕсли;	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("ПечатьСОборотом");
	//	ТабДокумент.Вывести(ОбластьМакета);
	//КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // СформироватьПечатнуюФормуКМ6()

#КонецОбласти

#Область Прочее

// Функция возвращает пустую структуру состояния кассовой смены.
//
Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;

	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусыКассовойСмены");
	СостояниеКассовойСмены.Вставить("НачалоКассовойСмены");
	СостояниеКассовойСмены.Вставить("ОкончаниеКассовойСмены");
	
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");	
	
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	// Описание реквизитов кассовой смены
	//СостояниеКассовойСмены.Вставить("Касса");
	//СостояниеКассовойСмены.Вставить("Валюта");
	//СостояниеКассовойСмены.Вставить("ВалютаПредставление");
	//СостояниеКассовойСмены.Вставить("СтруктурнаяЕдиница");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции // ПолучитьСтруктуруОписанияКассовойСмены()

#КонецОбласти

#КонецОбласти

#КонецЕсли
